In [1]:
import pandas as pd

In [2]:
data1={"Name":["Dushyant","Rohit","Hemant","Navneet","Aman","Subhasis"], "Age":[19,19,20,19,19,20], "specialization":["All","cp","cp","python","All","web/dev"]}

In [3]:
data1

{'Name': ['Dushyant', 'Rohit', 'Hemant', 'Navneet', 'Aman', 'Subhasis'],
 'Age': [19, 19, 20, 19, 19, 20],
 'specialization': ['All', 'cp', 'cp', 'python', 'All', 'web/dev']}

In [4]:
df1=pd.DataFrame(data1)

In [5]:
df1

       Name  Age specialization
0  Dushyant   19            All
1     Rohit   19             cp
2    Hemant   20             cp
3   Navneet   19         python
4      Aman   19            All
5  Subhasis   20        web/dev

In [7]:
df1["Name"]

0    Dushyant
1       Rohit
2      Hemant
3     Navneet
4        Aman
5    Subhasis
Name: Name, dtype: object

In [8]:
df1.Age

0    19
1    19
2    20
3    19
4    19
5    20
Name: Age, dtype: int64

In [9]:
type(data1)

dict

In [10]:
type(df1)

pandas.core.frame.DataFrame

In [11]:
type(df1["Name"])

pandas.core.series.Series

In [13]:
age=pd.Series([19,19,18,19,20], name="Age")

In [14]:
age

0    19
1    19
2    18
3    19
4    20
Name: Age, dtype: int64

In [15]:
type(age)

pandas.core.series.Series

In [16]:
age.max()

20

In [17]:
df1

       Name  Age specialization
0  Dushyant   19            All
1     Rohit   19             cp
2    Hemant   20             cp
3   Navneet   19         python
4      Aman   19            All
5  Subhasis   20        web/dev

In [18]:
df1.describe()

             Age
count   6.000000
mean   19.333333
std     0.516398
min    19.000000
25%    19.000000
50%    19.000000
75%    19.750000
max    20.000000

In [22]:
Country=["India","America","Africa","Canada","Germany"]
Capital = ["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"]
Area = [8.516, 17.10, 3.286, 9.67, 2.98]
Population = [200.4, 143.5, 1252, 133, 4.3]

In [25]:
df2=pd.DataFrame({"country":Country,"capital":Capital,"area":Area,"population":Population})

In [26]:
df2

   country    capital    area  population
0    India   Brasilia   8.516       200.4
1  America     Moscow  17.100       143.5
2   Africa  New Delhi   3.286      1252.0
3   Canada    Beijing   9.670       133.0
4  Germany   Pretoria   2.980         4.3

In [28]:
df1.shape

(6, 3)

In [29]:
df2.index

RangeIndex(start=0, stop=5, step=1)

In [32]:
df2.index = range(2,12,2)

In [33]:
df2

    country    capital    area  population
2     India   Brasilia   8.516       200.4
4   America     Moscow  17.100       143.5
6    Africa  New Delhi   3.286      1252.0
8    Canada    Beijing   9.670       133.0
10  Germany   Pretoria   2.980         4.3

In [36]:
df1.index = ["A", "B", "C", "D", "E","F"]

In [37]:
df1

       Name  Age specialization
A  Dushyant   19            All
B     Rohit   19             cp
C    Hemant   20             cp
D   Navneet   19         python
E      Aman   19            All
F  Subhasis   20        web/dev

In [38]:
df1.columns

Index(['Name', 'Age', 'specialization'], dtype='object')

In [39]:
type(df1.columns)

pandas.core.indexes.base.Index

In [40]:
df1["specialization"]

A        All
B         cp
C         cp
D     python
E        All
F    web/dev
Name: specialization, dtype: object

In [41]:
df1[["specialization"]]

  specialization
A            All
B             cp
C             cp
D         python
E            All
F        web/dev

In [42]:
df1.dtypes

Name              object
Age                int64
specialization    object
dtype: object

In [43]:
df1.set_index("Age")

         Name specialization
Age
19   Dushyant            All
19      Rohit             cp
20     Hemant             cp
19    Navneet         python
19       Aman            All
20   Subhasis        web/dev

In [44]:
df1

       Name  Age specialization
A  Dushyant   19            All
B     Rohit   19             cp
C    Hemant   20             cp
D   Navneet   19         python
E      Aman   19            All
F  Subhasis   20        web/dev

In [45]:
df1 = df1.set_index("Age")

In [46]:
df1

         Name specialization
Age
19   Dushyant            All
19      Rohit             cp
20     Hemant             cp
19    Navneet         python
19       Aman            All
20   Subhasis        web/dev

In [48]:
df1.reset_index()

   Age      Name specialization
0   19  Dushyant            All
1   19     Rohit             cp
2   20    Hemant             cp
3   19   Navneet         python
4   19      Aman            All
5   20  Subhasis        web/dev

In [127]:
df1

  index         2   3        4
0     a  Dushyant  19      All
1     1     Rohit  19       cp
2     2    Hemant  20       cp
3     3   Navneet  19   python
4     4      Aman  19      All
5     5  Subhasis  20  web/dev

In [50]:
df1=df1.reset_index()

In [51]:
df1

   Age      Name specialization
0   19  Dushyant            All
1   19     Rohit             cp
2   20    Hemant             cp
3   19   Navneet         python
4   19      Aman            All
5   20  Subhasis        web/dev

In [52]:
df1 = df1.set_index("Age")

In [53]:
df1

         Name specialization
Age
19   Dushyant            All
19      Rohit             cp
20     Hemant             cp
19    Navneet         python
19       Aman            All
20   Subhasis        web/dev

In [54]:
df1.reset_index(inplace=True)

In [55]:
df1

   Age      Name specialization
0   19  Dushyant            All
1   19     Rohit             cp
2   20    Hemant             cp
3   19   Navneet         python
4   19      Aman            All
5   20  Subhasis        web/dev

In [56]:
df1.set_index("Name",inplace=True)

In [57]:
df1

          Age specialization
Name
Dushyant   19            All
Rohit      19             cp
Hemant     20             cp
Navneet    19         python
Aman       19            All
Subhasis   20        web/dev

In [58]:
df1.reset_index(inplace = True)

In [59]:
df1

       Name  Age specialization
0  Dushyant   19            All
1     Rohit   19             cp
2    Hemant   20             cp
3   Navneet   19         python
4      Aman   19            All
5  Subhasis   20        web/dev

In [64]:
df1.columns = range(len(df1.columns))

In [62]:
df1.columns[1]

1

In [65]:
df1

          0   1        2
0  Dushyant  19      All
1     Rohit  19       cp
2    Hemant  20       cp
3   Navneet  19   python
4      Aman  19      All
5  Subhasis  20  web/dev

In [67]:
df1.rename(columns={0:"Name"})

       Name   1        2
0  Dushyant  19      All
1     Rohit  19       cp
2    Hemant  20       cp
3   Navneet  19   python
4      Aman  19      All
5  Subhasis  20  web/dev

df1

In [68]:
df1

          0   1        2
0  Dushyant  19      All
1     Rohit  19       cp
2    Hemant  20       cp
3   Navneet  19   python
4      Aman  19      All
5  Subhasis  20  web/dev

In [69]:
df1.rename(columns={0:"Name",1:"Age",2:"specialization"},inplace=True)

In [70]:
df1

       Name  Age specialization
0  Dushyant   19            All
1     Rohit   19             cp
2    Hemant   20             cp
3   Navneet   19         python
4      Aman   19            All
5  Subhasis   20        web/dev

In [71]:
df1.rename(index={0:"a"},inplace=True)

In [72]:
df1

       Name  Age specialization
a  Dushyant   19            All
1     Rohit   19             cp
2    Hemant   20             cp
3   Navneet   19         python
4      Aman   19            All
5  Subhasis   20        web/dev

In [73]:
df1.reset_index()

  index      Name  Age specialization
0     a  Dushyant   19            All
1     1     Rohit   19             cp
2     2    Hemant   20             cp
3     3   Navneet   19         python
4     4      Aman   19            All
5     5  Subhasis   20        web/dev

In [74]:
df1

       Name  Age specialization
a  Dushyant   19            All
1     Rohit   19             cp
2    Hemant   20             cp
3   Navneet   19         python
4      Aman   19            All
5  Subhasis   20        web/dev

In [76]:
df1=df1.reset_index()

In [77]:
df1

  index      Name  Age specialization
0     a  Dushyant   19            All
1     1     Rohit   19             cp
2     2    Hemant   20             cp
3     3   Navneet   19         python
4     4      Aman   19            All
5     5  Subhasis   20        web/dev

In [78]:
df1=df1.reset_index()

In [79]:
df1

   level_0 index      Name  Age specialization
0        0     a  Dushyant   19            All
1        1     1     Rohit   19             cp
2        2     2    Hemant   20             cp
3        3     3   Navneet   19         python
4        4     4      Aman   19            All
5        5     5  Subhasis   20        web/dev

In [80]:
df1=df1.reset_index()

ValueError: cannot insert level_0, already exists

In [81]:
df1

   level_0 index      Name  Age specialization
0        0     a  Dushyant   19            All
1        1     1     Rohit   19             cp
2        2     2    Hemant   20             cp
3        3     3   Navneet   19         python
4        4     4      Aman   19            All
5        5     5  Subhasis   20        web/dev

In [86]:
df1.columns=range(len(df1.columns))

In [87]:
df1

   0  1         2   3        4
0  0  a  Dushyant  19      All
1  1  1     Rohit  19       cp
2  2  2    Hemant  20       cp
3  3  3   Navneet  19   python
4  4  4      Aman  19      All
5  5  5  Subhasis  20  web/dev

In [88]:
col=list(df1.columns)

In [91]:
type(col)

list

In [92]:
col[1]="index"

In [93]:
col

[0, 'index', 2, 3, 4]

In [94]:
df1.columns = col

In [95]:
df1

   0 index         2   3        4
0  0     a  Dushyant  19      All
1  1     1     Rohit  19       cp
2  2     2    Hemant  20       cp
3  3     3   Navneet  19   python
4  4     4      Aman  19      All
5  5     5  Subhasis  20  web/dev

In [105]:
df2

    country    capital    area  population
2     India   Brasilia   8.516       200.4
4   America     Moscow  17.100       143.5
6    Africa  New Delhi   3.286      1252.0
8    Canada    Beijing   9.670       133.0
10  Germany   Pretoria   2.980         4.3

In [106]:
df2.rename(columns={"country":"a"})

          a    capital    area  population
2     India   Brasilia   8.516       200.4
4   America     Moscow  17.100       143.5
6    Africa  New Delhi   3.286      1252.0
8    Canada    Beijing   9.670       133.0
10  Germany   Pretoria   2.980         4.3

In [107]:
df2

    country    capital    area  population
2     India   Brasilia   8.516       200.4
4   America     Moscow  17.100       143.5
6    Africa  New Delhi   3.286      1252.0
8    Canada    Beijing   9.670       133.0
10  Germany   Pretoria   2.980         4.3

In [109]:
df2.rename(mapper=str.upper, axis=1)

    COUNTRY    CAPITAL    AREA  POPULATION
2     India   Brasilia   8.516       200.4
4   America     Moscow  17.100       143.5
6    Africa  New Delhi   3.286      1252.0
8    Canada    Beijing   9.670       133.0
10  Germany   Pretoria   2.980         4.3

In [110]:
df2

    country    capital    area  population
2     India   Brasilia   8.516       200.4
4   America     Moscow  17.100       143.5
6    Africa  New Delhi   3.286      1252.0
8    Canada    Beijing   9.670       133.0
10  Germany   Pretoria   2.980         4.3

In [111]:
df1

   0 index         2   3        4
0  0     a  Dushyant  19      All
1  1     1     Rohit  19       cp
2  2     2    Hemant  20       cp
3  3     3   Navneet  19   python
4  4     4      Aman  19      All
5  5     5  Subhasis  20  web/dev

In [115]:
df1.drop(columns=0,axis=1,inplace=True)

In [116]:
df1

  index         2   3        4
0     a  Dushyant  19      All
1     1     Rohit  19       cp
2     2    Hemant  20       cp
3     3   Navneet  19   python
4     4      Aman  19      All
5     5  Subhasis  20  web/dev

In [121]:
df1.reset_index(inplace=True)

ValueError: cannot insert level_0, already exists

In [122]:
df1

   level_0 index         2   3        4
0        0     a  Dushyant  19      All
1        1     1     Rohit  19       cp
2        2     2    Hemant  20       cp
3        3     3   Navneet  19   python
4        4     4      Aman  19      All
5        5     5  Subhasis  20  web/dev

In [123]:
df1.drop(columns="level_0",axis = 1, inplace = True)

In [124]:
df1

  index         2   3        4
0     a  Dushyant  19      All
1     1     Rohit  19       cp
2     2    Hemant  20       cp
3     3   Navneet  19   python
4     4      Aman  19      All
5     5  Subhasis  20  web/dev

In [125]:
b=df1.reset_index(drop=True)

In [126]:
b

  index         2   3        4
0     a  Dushyant  19      All
1     1     Rohit  19       cp
2     2    Hemant  20       cp
3     3   Navneet  19   python
4     4      Aman  19      All
5     5  Subhasis  20  web/dev